# NewName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementTypeDuplicatedEventArgs..::..NewName Property
ElementTypeDuplicatedEventArgs Class See Also
---
The name of the newly duplicated ElementType.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string NewName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NewName As String
	Get
```

Visual C++
---
```text
public:
property String^ NewName {
	String^ get ();
}
```

# See Also
ElementTypeDuplicatedEventArgs Class
Autodesk.Revit.DB.Events Namespace